## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                  NAME                                                  |
|----------|--------------------------------------------------------------------------------------------------------|
| add      | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.notification.alpha.canada.ca&quot;]`                  |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.notification.alpha.canada.ca&quot;]`             |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.notification.alpha.canada.ca&quot;]`                      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;api.notification.alpha.canada.ca&quot;]`                    |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;notification.alpha.canada.ca&quot;]`                        |
|          | `aws_route53_record.notification-canada-ca[&quot;*.api.notification.canada.ca&quot;]`                            |
|          | `aws_route53_record.notification-canada-ca[&quot;*.document.notification.canada.ca&quot;]`                       |
|          | `aws_route53_record.notification-canada-ca[&quot;*.notification.canada.ca&quot;]`                                |
|          | `aws_route53_record.notification-canada-ca[&quot;api.notification.canada.ca&quot;]`                              |
|          | `aws_route53_record.notification-canada-ca[&quot;notification.canada.ca&quot;]`                                  |
| update   | `module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                  |
| recreate | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|          | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.admin_api_request has moved to aws_cloudwatch_log_subscription_filter.admin_api_request[0]
    resource "aws_cloudwatch_log_subscription_filter" "admin_api_request" {
        id              = "cwlsf-2337749455"
        name            = "Admin API request"
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.blazer_logging has moved to aws_cloudwatch_log_subscription_filter.blazer_logging[0]
    resource "aws_cloudwatch_log_subscription_filter" "blazer_logging" {
        id              = "cwlsf-1214848348"
        name            = "Blazer logging"
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.notification-canada-ca["*.api.notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca"
      + records         = [
          + "_ac309158c158035bfb929da1617e2b16.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["*.document.notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_db43d1cf891afd4671fb913d18ef0a0e.document.notification.canada.ca"
      + records         = [
          + "_130ea19fa1fdd9e59b7632fbac0d7e00.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["*.notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_2115a5004ab7895234c60254e152046b.notification.canada.ca"
      + records         = [
          + "_aaacd89cd470de0970c70c7ab1b7d4d5.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["api.notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca"
      + records         = [
          + "_ac309158c158035bfb929da1617e2b16.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["notification.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_2115a5004ab7895234c60254e152046b.notification.canada.ca"
      + records         = [
          + "_aaacd89cd470de0970c70c7ab1b7d4d5.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5d022a2aee7df473fcb75e0e12b47220.api.notification.alpha.canada.ca"
      + records         = [
          + "_f52039e56b4219e56f5e258613b5c77d.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_35e023fab08debc90c4312ec398d5458.document.notification.alpha.canada.ca"
      + records         = [
          + "_851a551fec0bff7d31f336583a3138e7.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_c04744a360b120e8b7431728784deab4.notification.alpha.canada.ca"
      + records         = [
          + "_70060f7d839ca6659556126a3224d85b.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["api.notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5d022a2aee7df473fcb75e0e12b47220.api.notification.alpha.canada.ca"
      + records         = [
          + "_f52039e56b4219e56f5e258613b5c77d.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["notification.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_c04744a360b120e8b7431728784deab4.notification.alpha.canada.ca"
      + records         = [
          + "_70060f7d839ca6659556126a3224d85b.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
      + code_signing_config_arn        = ""
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
        id                             = "sentinel-cloud-watch-forwarder"
      + image_uri                      = ""
      + kms_key_arn                    = ""
      ~ last_modified                  = "2023-01-23T14:37:18.794+0000" -> (known after apply)
      + publish                        = false
      + signing_job_arn                = ""
      + signing_profile_version_arn    = ""
        tags                           = {
            "CostCentre" = "notification-canada-ca-production"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "CUSTOMER_ID" = (sensitive)
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "SHARED_KEY"  = (sensitive)
                # (1 unchanged element hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] must be replaced
-/+ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      ~ function_name       = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" -> "sentinel-cloud-watch-forwarder" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] must be replaced
-/+ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      ~ function_name       = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder" -> "sentinel-cloud-watch-forwarder" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 12 to add, 1 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
